#define _CRT_SECURE_NO_WARNINGS 1

// // 下面代码运行时输出啥 -3
//#include <stdio.h>
//int main()
//{
//	int i = -20;
//	//-20
//	// 10000000-00000000-00000000-00010100
//	// 11111111-11111111-11111111-11101011
//	// 11111111-11111111-11111111-11101100
//	unsigned int j = 10;
//	// 00000000-00000000-00000000-00001010
//	printf("%d\n", i + j);
//	// 按照补码的形式计算，最后格式化为有符号的整型
//	// unsigned int和 signed int运算时会先提升为unsigned int
//	// 11111111-11111111-11111111-11101100 // -20
//	// 00000000-00000000-00000000-00001010 // 10
//	// -----------------------------------
//	// 11111111-11111111-11111111-11110110 // 最后打印的是有符号的整型，最高位为符号位
//	// 11111111-11111111-11111111-11110101 // 反码->原码最高位不变
//	// 10000000-00000000-00000000-00001010 // -10
//	return 0;
//}


// 下面代码运行时输出啥 -4
//#include <stdio.h>
//int main()
//{
//    unsigned int i = 0;
//    for (i = 9; i >= 0; i--)
//    {
//        printf("%u\n", i);
//    }
//    return 0;
//}

//// 下面代码运行时输出啥 -5
//#include <stdio.h>
//int main()
//{
//    char a[1000];
//    int i;
//    for (i = 0; i < 10000; i++)
//    {
//        a[i] = -1 - i;
//    }
//    printf("%d", strlen(a)); // 255
//    return 0;
//}

////// 下面代码运行时输出啥 -6
//#include <stdio.h>
//unsigned char i = 0;
//int main()
//{
//    for (i = 0; i <= 255; i++)
//    {
//        printf("hello world-%d\n",i);
//    } // 死循环
//    return 0;
//}

#include <stdio.h>
int main()
{
	int n = 9;
	// 00000000-00000000-00000000-00001001
	
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);

	printf("*pFloat的值为：%f\n", *pFloat);
	// 0 00000000 00000000000000000001001
	// E为全0
	// (-1)^0 * 0.00000000000000000001001 * 2^-126

	*pFloat = 9.0;
	// 1001.0
	// 1.001*2^3
	// (-1)^0 * 1.001 * 2^3
	// 0 10000010 00100000000000000000000

	printf("n的值为：%d\n", n);// 1091567616
	// 01000001 - 00010000 - 00000000 - 00000000(二进制)

	printf("*pFloat的值为：%f\n", *pFloat);

	/*
	n的值为：9
	00000000-00000000-00000000-00001001(二进制)
	*pFloat的值为：0.000000
	
	n的值为：1091567616
	01000001-00010000-00000000-00000000(二进制)
	*pFloat的值为：9.000000
	*/
	return 0;
}