#define _CRT_SECURE_NO_WARNINGS 1


//#include <stdio.h>
//int main()
//{
//    int a = 20;
//    int b = -10;
//    return 0;
//}

//#include <stdio.h>
//int main()
//{
//    int a = 1;
//    // 1的16进制->0x00-00-00-01
//    // 大端 00-00-00-01
//    // 小端 01-00-00-00
//    char* p = (char* )&a;
//    // char指针类型只能访问1个字节
//    //char* p = &a; // 直接访问会出现精度丢失，使用强制访问
//
//    // p访问的是变量的第一个字节，如果是1就是小端，如果是0就是大端
//    if (*p == 1)
//    {
//        printf("小");
//    }
//    else if(*p == 0)
//    {
//        printf("大");
//    }
//    return 0;
//}

//#include <stdio.h>
//
////int check_sys()
////{
////	int a = 1;
////	char* p = (char*)&a;
////	if (*p == 1) 
////	{
////		return 1;
////	}
////	else 
////	{
////		return 0;
////	}
////}
//
////// 简化
////int check_sys()
////{
////	int a = 1;
////	char* p = (char*)&a;
////	// 返回1，小端
////	// 返回0，大端
////	return p;
////}
//
//// 简简化
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1) 
//	{
//		printf("小端\n");
//	}
//	else 
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//// 下面代码输出啥-1
//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	char signed b = -1;
//	char unsigned c = -1;
//	// -1
//	// 10000000-00000000-00000000-00000001
//	// 11111111-11111111-11111111-11111110
//	// 11111111-11111111-11111111-11111111
//	//
//	// 由于a,b,c都是char类型只能存放一个字节，而vs2022又是小端字节序，所以存放的是最右边的一个字节，及内存中最左边一个字节
//	// a - 11111111	- 有符号变量，符号位为1，整型提升时右边补1
//	// b - 11111111 - 有符号变量，符号位为1，整型提升时右边补1
//	// c - 11111111 - 无符号变量，默认符号位为0，整型提升时右边补0
//	// 由于a，b为有符号变量，所以他们有符号位且为1，在运算进行整型提升时补1
//	// 而c为无符号变量，默认符号位为0，在运算进行整型提升时补0
//
//	printf("a = %d, b = %d, c = %d\n", a, b, c);
//	//打印时
//	// a 整型提升-> 11111111-11111111-11111111-11111111 - -1
//	// b 整型提升-> 11111111-11111111-11111111-11111111 - -1
//	// c 整型提升-> 00000000-00000000-00000000-11111111 - 255
//	//
//
//	return 0;
//}


// 下面代码输出啥-2
#include <stdio.h>
int main()
{
	char a = -128;//试试看当a=-129、a=128会发生什么
	// -128
	// 10000000-00000000-00000000-10000000
	// 11111111-11111111-11111111-01111111
	// 11111111-11111111-11111111-10000000
	// 由于a是char类型只能存放一个字节，而vs2022又是小端字节序，
	// 所以存放的是最右边的一个字节，及内存中最左边一个字节 10000000
	// a - 10000000

	printf("a = %u\n", a);//打印10进制无符号整型
	// 4294967168
	// 11111111-11111111-11111111-10000000

	printf("a = %c\n", a);//打印字符
	// �
	
	printf("a = %d\n", a);//打印10进制有符号整型
	// -128
	
	return 0;
}